string : immutable, ordered, duplicate allowed   : " "
list   : mutable, ordered, duplicates allowed    : []
tuple  : immutable, ordered, duplicates allowed  : ()
set    : mutable, unordered, duplicates not allowed: set(), {1,}
frozen set: immutable, unordered, duplicates not allowed  frozenset()

dict   : mutable, 
        ordered  >= Python 3.6 version
        unordered < Python 3.6 version
        keys can not be duplicate    >> Allows Immutable data types (int, float,complex,string, tuple)
        Values can be duplicate      >> Allows all data types         
                                                  : {} , {key1:value,key2:value}

dict consist of key value pair & every key value pair is comma separated.
keys are case sensitive
keys & values are separated by colon (:)

In [1]:
dict1 = {}
type(dict1)

dict

In [2]:
d1 = {'Name':'Sachin'}
print(d1,len(d1),type(d1))

{'Name': 'Sachin'} 1 <class 'dict'>

In [7]:
players_data = {'Name':'Sachin','Age':45,'Jersey num':10,'Highest score':200,100:[48,52],50:[100,98]}

players_data

{'Name': 'Sachin',
 'Age': 45,
 'Jersey num': 10,
 'Highest score': 200,
 100: [48, 52],
 50: [100, 98]}

In [4]:
len(players_data)

6

In [9]:
import pandas as pd

df = pd.DataFrame(players_data)
df

     Name  Age  Jersey num  Highest score  100   50
0  Sachin   45          10            200   48  100
1  Sachin   45          10            200   52   98

In [15]:
import pandas as pd

df = pd.DataFrame.from_dict(players_data,orient = 'index')
df = df.T
display(df)

     Name Age Jersey num Highest score       100         50
0  Sachin  45         10           200  [48, 52]  [100, 98]

In [ ]:
df.to_excel('player.xlsx')

In [17]:
players= {1:{'Name':'Sachin','Age':45,'Score':200},
         2:{'Name':'Sehvag','Age':44,'Score':219}}

players

{1: {'Name': 'Sachin', 'Age': 45, 'Score': 200},
 2: {'Name': 'Sehvag', 'Age': 44, 'Score': 219}}

In [21]:
df = pd.DataFrame(players)
df = df.T
df

     Name Age Score
1  Sachin  45   200
2  Sehvag  44   219

In [22]:
df.to_csv('2_players.csv')

# Accessing items in dict

In [23]:
employees = {'Emp_name':'Kunal','Salary':80000,'Designation':'Data Scientist','Age':30,'Emp_ID':10011}

employees

{'Emp_name': 'Kunal',
 'Salary': 80000,
 'Designation': 'Data Scientist',
 'Age': 30,
 'Emp_ID': 10011}

In [24]:
employees['Emp_name']    # keys should be passed inside brackets to access the values belonging to that perticular key

'Kunal'

In [26]:
employees['Salary']

80000

In [28]:
employees['salary']      # keys are case sensitive

KeyError: 'salary'

In [32]:
employees['experience']  # thows an error if such key is not present in dict

KeyError: 'experience'

## get function

In [29]:
employees.get('Salary')

80000

In [30]:
employees.get('Emp_ID')

10011

In [31]:
employees.get('Experience')      # if the key is not found then it returns nothing!

## for loop for accessing keys

In [33]:
for key in employees:
    print(key)

Emp_name
Salary
Designation
Age
Emp_ID

In [34]:
for key in employees:
    print(key,'-----',employees[key])

Emp_name ----- Kunal
Salary ----- 80000
Designation ----- Data Scientist
Age ----- 30
Emp_ID ----- 10011

In [35]:
for i in employees:
    print(i)

Emp_name
Salary
Designation
Age
Emp_ID

# Dict function to access keys

### .keys()

In [36]:
employees.keys()

dict_keys(['Emp_name', 'Salary', 'Designation', 'Age', 'Emp_ID'])

In [37]:
for key in employees.keys():
    print(key)

Emp_name
Salary
Designation
Age
Emp_ID

# Dict function to access values

## .values()

In [38]:
employees.values()

dict_values(['Kunal', 80000, 'Data Scientist', 30, 10011])

In [39]:
for value in employees.values():
    print(value)

Kunal
80000
Data Scientist
30
10011

# Dict function to access items

## .items()

In [40]:
employees.items()

dict_items([('Emp_name', 'Kunal'), ('Salary', 80000), ('Designation', 'Data Scientist'), ('Age', 30), ('Emp_ID', 10011)])

In [41]:
list(employees.items())

[('Emp_name', 'Kunal'),
 ('Salary', 80000),
 ('Designation', 'Data Scientist'),
 ('Age', 30),
 ('Emp_ID', 10011)]

In [42]:
for item in employees.items():
    print(item)

('Emp_name', 'Kunal')
('Salary', 80000)
('Designation', 'Data Scientist')
('Age', 30)
('Emp_ID', 10011)

In [44]:
for key,value in employees.items():
    print(key,'>>',value)

Emp_name >> Kunal
Salary >> 80000
Designation >> Data Scientist
Age >> 30
Emp_ID >> 10011